Revit 2024 API
SharedParameterApplicableRule Properties
The SharedParameterApplicableRule type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
ParameterName
 The name of the parameter that an element must support to pass this rule.
See Also
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace